# пример с рандомным расписанием
# from variables import *
# import random
# count = 0
# while count < 100:
#     a = 3
#     b = 9
#     A = random.randint(a, b)
#     rand = ['математика', 'русский язык', 'английский язык', 'информатика', 'физика', 'история', 'труд', 'музыка',
#             'химия', 'физкультура', 'немецкий язык', 'изо', 'история', 'обж', 'литература', 'обществознание', 'биология', 'география']
#     B = sorted(rand, key=lambda A: random.random())
#     B = B[0:A]
#     B = "\\n".join(B)
#     print(B)
#     count += 1
q1 = 'химия\nмузыка\nтруд\nматематика\nобществознание\nбиология\nинформатика\nобж'
q2 = 'физкультура\nгеография\nизо\nинформатика\nматематика\nлитература\nхимия'
q3 = 'обществознание\nбиология\nфизкультура\nизо\nрусский язык\nобж\nнемецкий язык\nистория'
q4 = 'история\nнемецкий язык\nистория\nмузыка\nбиология\nанглийский язык\nфизкультура'
q5 = 'история\nхимия\nобж\nфизкультура\nлитература'
q6 = 'обж\nобществознание\nфизкультура\nматематика\nфизика\nгеография\nхимия\nмузыка'
q7 = 'география\nтруд\nобж'
q8 = 'физкультура\nгеография\nбиология\nтруд\nистория'
q9 = 'химия\nфизкультура\nнемецкий язык\nбиология\nистория\nгеография'
q10 = 'история\nфизкультура\nфизика\nрусский язык\nизо\nистория\nтруд'
q11 = 'история\nинформатика\nрусский язык'
q12 = 'русский язык\nизо\nлитература\nанглийский язык\nобществознание\nгеография'
q13 = 'история\nлитература\nгеография\nнемецкий язык\nбиология\nанглийский язык\nхимия\nизо\nистория'
q14 = 'физкультура\nхимия\nнемецкий язык'
q15 = 'география\nрусский язык\nанглийский язык\nбиология\nтруд\nфизкультура\nистория\nхимия'
q16 = 'музыка\nхимия\nтруд'
q17 = 'биология\nинформатика\nматематика\nмузыка\nгеография'
q18 = 'математика\nхимия\nизо\nрусский язык\nтруд'
q19 = 'география\nобществознание\nхимия\nмузыка\nизо\nтруд\nбиология\nистория\nобж'
q20 = 'физика\nтруд\nобществознание\nрусский язык\nгеография\nхимия\nистория\nинформатика\nлитература'
q21 = 'география\nрусский язык\nфизика\nобществознание\nизо\nистория'
q22 = 'химия\nмузыка\nтруд'
q23 = 'русский язык\nтруд\nматематика\nбиология\nгеография\nмузыка\nфизкультура'
q24 = 'география\nобществознание\nхимия\nмузыка\nизо\nтруд\nбиология\nистория\nобж'
q25 = 'география\nистория\nобществознание\nистория'
q26 = 'биология\nрусский язык\nобж\nфизкультура\nинформатика\nлитература\nистория'
q27 = 'история\nфизкультура\nфизика\nрусский язык\nизо\nистория\nтруд'
q28 = 'немецкий язык\nистория\nанглийский язык'
q29 = 'физкультура\nнемецкий язык\nгеография\nистория\nбиология'
q30 = 'история\nизо\nфизика'
q31 = 'физкультура\nобж\nхимия\nобществознание'
q32 = 'информатика\nматематика\nлитература\nмузыка\nанглийский язык\nфизкультура\nнемецкий язык\nобж\nистория'
q33 = 'история\nхимия\nобж\nфизкультура\nлитература'
q34 = 'английский язык\nфизика\nхимия\nмузыка\nрусский язык\nлитература\nистория'
q35 = 'обществознание\nхимия\nфизкультура\nизо\nгеография\nматематика\nистория\nбиология\nфизика'
q36 = 'история\nнемецкий язык\nистория\nмузыка\nбиология\nанглийский язык\nфизкультура'
q37 = 'литература\nфизкультура\nматематика\nинформатика\nхимия'
q38 = 'биология\nрусский язык\nизо\nфизика\nлитература\nанглийский язык\nобществознание\nистория'
q39 = 'обществознание\nбиология\nфизкультура\nизо\nрусский язык\nобж\nнемецкий язык\nистория'
q40 = 'физкультура\nобществознание\nобж\nизо\nлитература\nтруд\nгеография\nнемецкий язык\nбиология'
q41 = 'физкультура\nгеография\nизо\nинформатика\nматематика\nлитература\nхимия'
q42 = 'музыка\nлитература\nтруд\nанглийский язык\nгеография'
q43 = 'история\nлитература\nистория\nтруд\nхимия\nфизкультура\nобществознание\nизо\nгеография'
q44 = 'история\nфизкультура\nфизика\nрусский язык\nизо\nистория\nтруд'
